<template>
  <div class="container-privacy-policy">
    <img
      src="imgs_main_page/img-home-icon.svg"
      alt=""
      class="container-privacy-policy__img-home-icon"
    />
    <p class="container-privacy-policy__text-home-icon">
      Политика конфиденциальности
    </p>
    <h1 class="container-privacy-policy__title">Политика конфиденциальности</h1>
    <div class="container-privacy-policy__border"></div>
    <a
      @click="goToMainPage"
      class="container-privacy-policy__advertise-btn-back-to-the-previous-page"
      >На главную</a
    >
    <div class="container-privacy-policy__text-flex">
      <p class="container-privacy-policy__text-title">1. Общие положения</p>
      <p class="container-privacy-policy__text">
        Настоящая политика обработки персональных данных составлена в
        соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ
        «О персональных данных» (далее - Закон о персональных данных) и
        определяет порядок обработки персональных данных и меры по обеспечению
        безопасности персональных данных, предпринимаемые Михайловым Иваном
        Сергеевичем (далее – Оператор). 1.1. Оператор ставит своей важнейшей
        целью и условием осуществления своей деятельности соблюдение прав и
        свобод человека и гражданина при обработке его персональных данных, в
        том числе защиты прав на неприкосновенность частной жизни, личную и
        семейную тайну. 1.2. Настоящая политика Оператора в отношении обработки
        персональных данных (далее – Политика) применяется ко всей информации,
        которую Оператор может получить о посетителях веб-сайта
        httpsː//thismywebsite·com.
      </p>
      <p class="container-privacy-policy__text-title">
        2. Основные понятия, используемые в Политике
      </p>
      <p class="container-privacy-policy__text">
        2.1. Автоматизированная обработка персональных данных – обработка
        персональных данных с помощью средств вычислительной техники. 2.2.
        Блокирование персональных данных – временное прекращение обработки
        персональных данных (за исключением случаев, если обработка необходима
        для уточнения персональных данных). 2.3. Веб-сайт – совокупность
        графических и информационных материалов, а также программ для ЭВМ и баз
        данных, обеспечивающих их доступность в сети интернет по сетевому адресу
        httpsː//thismywebsite·com. 2.4. Информационная система персональных
        данных — совокупность содержащихся в базах данных персональных данных, и
        обеспечивающих их обработку информационных технологий и технических
        средств. 2.5. Обезличивание персональных данных — действия, в результате
        которых невозможно определить без использования дополнительной
        информации принадлежность персональных данных конкретному Пользователю
        или иному субъекту персональных данных. 2.6. Обработка персональных
        данных – любое действие (операция) или совокупность действий (операций),
        совершаемых с использованием средств автоматизации или без использования
        таких средств с персональными данными, включая сбор, запись,
        систематизацию, накопление, хранение, уточнение (обновление, изменение),
        извлечение, использование, передачу (распространение, предоставление,
        доступ), обезличивание, блокирование, удаление, уничтожение персональных
        данных. 2.7. Оператор – государственный орган, муниципальный орган,
        юридическое или физическое лицо, самостоятельно или совместно с другими
        лицами организующие и (или) осуществляющие обработку персональных
        данных, а также определяющие цели обработки персональных данных, состав
        персональных данных, подлежащих обработке, действия (операции),
        совершаемые с персональными данными. 2.8. Персональные данные – любая
        информация, относящаяся прямо или косвенно к определенному или
        определяемому Пользователю веб-сайта httpsː//thismywebsite·com. 2.9.
        Персональные данные, разрешенные субъектом персональных данных для
        распространения, - персональные данные, доступ неограниченного круга лиц
        к которым предоставлен субъектом персональных данных путем дачи согласия
        на обработку персональных данных, разрешенных субъектом персональных
        данных для распространения в порядке, предусмотренном Законом о
        персональных данных (далее - персональные данные, разрешенные для
        распространения). 2.10. Пользователь – любой посетитель веб-сайта
        httpsː//thismywebsite·com. 2.11. Предоставление персональных данных –
        действия, направленные на раскрытие персональных данных определенному
        лицу или определенному кругу лиц. 2.12. Распространение персональных
        данных – любые действия, направленные на раскрытие персональных данных
        неопределенному кругу лиц (передача персональных данных) или на
        ознакомление с персональными данными неограниченного круга лиц, в том
        числе обнародование персональных данных в средствах массовой информации,
        размещение в информационно-телекоммуникационных сетях или предоставление
        доступа к персональным данным каким-либо иным способом. 2.13.
        Трансграничная передача персональных данных – передача персональных
        данных на территорию иностранного государства органу власти иностранного
        государства, иностранному физическому или иностранному юридическому
        лицу. 2.14. Уничтожение персональных данных – любые действия, в
        результате которых персональные данные уничтожаются безвозвратно с
        невозможностью дальнейшего восстановления содержания персональных данных
        в информационной системе персональных данных и (или) уничтожаются
        материальные носители персональных данных.
      </p>
      <p class="container-privacy-policy__text-title">
        3. Основные права и обязанности Оператора
      </p>
      <p class="container-privacy-policy__text">
        3.1. Оператор имеет право: – получать от субъекта персональных данных
        достоверные информацию и/или документы, содержащие персональные данные;
        – в случае отзыва субъектом персональных данных согласия на обработку
        персональных данных Оператор вправе продолжить обработку персональных
        данных без согласия субъекта персональных данных при наличии оснований,
        указанных в Законе о персональных данных; – самостоятельно определять
        состав и перечень мер, необходимых и достаточных для обеспечения
        выполнения обязанностей, предусмотренных Законом о персональных данных и
        принятыми в соответствии с ним нормативными правовыми актами, если иное
        не предусмотрено Законом о персональных данных или другими федеральными
        законами. 3.2. Оператор обязан: – предоставлять субъекту персональных
        данных по его просьбе информацию, касающуюся обработки его персональных
        данных; – организовывать обработку персональных данных в порядке,
        установленном действующим законодательством РФ; – отвечать на обращения
        и запросы субъектов персональных данных и их законных представителей в
        соответствии с требованиями Закона о персональных данных; – сообщать в
        уполномоченный орган по защите прав субъектов персональных данных по
        запросу этого органа необходимую информацию в течение 30 дней с даты
        получения такого запроса; – публиковать или иным образом обеспечивать
        неограниченный доступ к настоящей Политике в отношении обработки
        персональных данных; – принимать правовые, организационные и технические
        меры для защиты персональных данных от неправомерного или случайного
        доступа к ним, уничтожения, изменения, блокирования, копирования,
        предоставления, распространения персональных данных, а также от иных
        неправомерных действий в отношении персональных данных; – прекратить
        передачу (распространение, предоставление, доступ) персональных данных,
        прекратить обработку и уничтожить персональные данные в порядке и
        случаях, предусмотренных Законом о персональных данных; – исполнять иные
        обязанности, предусмотренные Законом о персональных данных.
      </p>
      <p class="container-privacy-policy__text-title">
        4. Основные права и обязанности субъектов персональных данных
      </p>
      <p class="container-privacy-policy__text">
        4.1. Субъекты персональных данных имеют право: – получать информацию,
        касающуюся обработки его персональных данных, за исключением случаев,
        предусмотренных федеральными законами. Сведения предоставляются субъекту
        персональных данных Оператором в доступной форме, и в них не должны
        содержаться персональные данные, относящиеся к другим субъектам
        персональных данных, за исключением случаев, когда имеются законные
        основания для раскрытия таких персональных данных. Перечень информации и
        порядок ее получения установлен Законом о персональных данных; –
        требовать от оператора уточнения его персональных данных, их
        блокирования или уничтожения в случае, если персональные данные являются
        неполными, устаревшими, неточными, незаконно полученными или не являются
        необходимыми для заявленной цели обработки, а также принимать
        предусмотренные законом меры по защите своих прав; – выдвигать условие
        предварительного согласия при обработке персональных данных в целях
        продвижения на рынке товаров, работ и услуг; – на отзыв согласия на
        обработку персональных данных; – обжаловать в уполномоченный орган по
        защите прав субъектов персональных данных или в судебном порядке
        неправомерные действия или бездействие Оператора при обработке его
        персональных данных; – на осуществление иных прав, предусмотренных
        законодательством РФ. 4.2. Субъекты персональных данных обязаны: –
        предоставлять Оператору достоверные данные о себе; – сообщать Оператору
        об уточнении (обновлении, изменении) своих персональных данных. 4.3.
        Лица, передавшие Оператору недостоверные сведения о себе, либо сведения
        о другом субъекте персональных данных без согласия последнего, несут
        ответственность в соответствии с законодательством РФ.
      </p>
      <button
        @click="goToMainPage"
        class="container-privacy-policy__btn-back-to-the-previous-page"
      >
        <p class="container-privacy-policy__btn-back-to-the-previous-page-text">
          На главную
        </p>
      </button>
    </div>
  </div>
</template>

<script>
export default {
  name: "PrivacyPolicy",
  methods: {
    goToMainPage() {
      this.$router.push("/");
      window.scrollTo(0, 0);
    },
  },
};
</script>

<style lang="scss">
$white-col: #ffffff;
$dark-col: #1a1a25;
$red-col: #f53b49;
$gray-col: #858fa4;
$dark-blue-col: #384255;
$blue: #4b7ee8;
.container-privacy-policy {
  padding: 0.625rem 0.625rem 3.125rem 0.625rem;
}
.container-privacy-policy__img-home-icon {
  cursor: pointer;
}
.container-privacy-policy__text-home-icon {
  font-family: "Inter", sans-serif;
  font-size: 0.75rem;
  font-weight: 400;
  line-height: 140%;
  color: $gray-col;
  margin-top: -1.1rem;
  margin-left: 1.7rem;
  cursor: pointer;
}
.container-privacy-policy__title {
  font-family: "Inter", sans-serif;
  font-size: 1.5rem;
  font-weight: 800;
  line-height: 110%;
}
.container-privacy-policy__advertise-btn-back-to-the-previous-page {
  position: relative;
  font-family: "Inter", sans-serif;
  font-size: 1rem;
  font-weight: 700;
  color: $blue;
  cursor: pointer;
}
.container-privacy-policy__border {
  border: 1px solid rgba(133, 143, 164, 0.15);
  margin-top: 1rem;
  margin-bottom: 0.625rem;
}
.container-privacy-policy__text-flex {
  display: flex;
  flex-direction: column;
  gap: 0.625rem;
  margin-top: 0.688rem;
}
.container-privacy-policy__text-title {
  position: relative;
  font-family: "Inter", sans-serif;
  font-size: 1rem;
  font-weight: 800;
  line-height: 110%;
  color: #384255;
  margin-top: 0.625rem;
  margin-bottom: 0rem;
}
.container-privacy-policy__text {
  font-family: "Inter", sans-serif;
  font-size: 0.875rem;
  font-weight: 400;
  line-height: 140%;
  color: #384255;
  margin: 0rem;
}
.container-privacy-policy__btn-back-to-the-previous-page {
  display: flex;
  align-items: center;
  justify-content: center;
  width: fit-content;
  height: 42px;
  padding: 0.75rem 1.25rem 0.75rem 1.25rem;
  background: transparent;
  border: 1px solid $red-col;
  border-radius: 4px;
  margin-top: 0.625rem;
  font-family: "Inter", sans-serif;
  font-size: 0.875rem;
  font-weight: 700;
  color: $red-col;
  cursor: pointer;
}
/* 768px = 48em */
@media (min-width: 48em) {
  .container-privacy-policy {
    padding: 2.5rem 2.5rem 3.75rem 2.5rem;
  }
  .container-privacy-policy__title {
    font-size: 1.875rem;
  }
  .container-privacy-policy__btn-back-to-the-previous-page {
    font-size: 0.875rem;
  }
}

/* 1024px = 64em */
@media (min-width: 64em) {
  .container-privacy-policy__text-title {
    font-size: 1.125rem;
  }
  .container-privacy-policy__text {
    font-size: 1rem;
  }
}

/* 1440px = 90em */
@media (min-width: 90em) {
  .container-privacy-policy {
    padding: 3.75rem 10.313rem 7.5rem 10.313rem;
  }
}

/* 1920px = 120em */
@media (min-width: 120em) {
  .container-privacy-policy {
    padding: 3.75rem 15.938rem 7.5rem 15.938rem;
  }
}
</style>
